# 제공기관 그룹코드
PVSN_INST_GROUP_MAP = {
    "0054001": "중앙부처",
    "0054002": "지자체",
}

# 정책제공 방법코드
PLCY_PVSN_MTHD_MAP = {
    "0042001": "인프라 구축",
    "0042002": "프로그램",
    "0042003": "직접대출",
    "0042004": "공공기관",
    "0042005": "계약(위탁운영)",
    "0042006": "보조금",
    "0042007": "대출보증",
    "0042008": "공적보험",
    "0042009": "조세지출",
    "0042010": "바우처",
    "0042011": "정보제공",
    "0042012": "경제적 규제",
    "0042013": "기타",
}

# 정책승인 상태코드
PLCY_APRV_STTS_MAP = {
    "0044001": "신청",
    "0044002": "승인",
    "0044003": "반려",
    "0044004": "임시저장",
}

# 신청기간 구분코드
APLY_PRD_SE_MAP = {
    "0057001": "특정기간",
    "0057002": "상시",
    "0057003": "마감",
}

# 사업기간 구분코드
BIZ_PRD_SE_MAP = {
    "0056001": "특정기간",
    "0056002": "기타",
}

# 결혼상태 코드
MRG_STTS_MAP = {
    "0055001": "기혼",
    "0055002": "미혼",
    "0055003": "제한없음",
}

# 소득조건 구분코드
EARN_CND_SE_MAP = {
    "0043001": "무관",
    "0043002": "연소득",
    "0043003": "기타",
}

# 정책전공 요건코드
PLCY_MAJOR_MAP = {
    "0011001": "인문계열",
    "0011002": "사회계열",
    "0011003": "상경계열",
    "0011004": "이학계열",
    "0011005": "공학계열",
    "0011006": "예체능계열",
    "0011007": "농산업계열",
    "0011008": "기타",
    "0011009": "제한없음",
}

# 정책취업 요건코드
JOB_MAP = {
    "0013001": "재직자",
    "0013002": "자영업자",
    "0013003": "미취업자",
    "0013004": "프리랜서",
    "0013005": "일용근로자",
    "0013006": "(예비)창업자",
    "0013007": "단기근로자",
    "0013008": "영농종사자",
    "0013009": "기타",
    "0013010": "제한없음",
}

# 정책학력 요건코드
SCHOOL_MAP = {
    "0049001": "고졸 미만",
    "0049002": "고교 재학",
    "0049003": "고졸 예정",
    "0049004": "고교 졸업",
    "0049005": "대학 재학",
    "0049006": "대졸 예정",
    "0049007": "대학 졸업",
    "0049008": "석·박사",
    "0049009": "기타",
    "0049010": "제한없음",
}

# 정책특화 요건코드
SBIZ_MAP = {
    "0014001": "중소기업",
    "0014002": "여성",
    "0014003": "기초생활수급자",
    "0014004": "한부모가정",
    "0014005": "장애인",
    "0014006": "농업인",
    "0014007": "군인",
    "0014008": "지역인재",
    "0014009": "기타",
    "0014010": "제한없음",
}